In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([[1,1.2,np.nan],
                  [2.4,5.5,4.2],
                  [np.nan,np.nan,np.nan],
                  [0.44,-3.1,-4.1]],
                 index=[1,2,3,4],
                 columns=['A','B','C'])
df

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [5]:
df.head(2)

     A    B    C
1  1.0  1.2  NaN
2  2.4  5.5  4.2

In [7]:
df.tail(2)

      A    B    C
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [8]:
#통계량
df.describe()

              A     B         C
count  3.000000  3.00  2.000000
mean   1.280000  1.20  0.050000
std    1.009554  4.30  5.868986
min    0.440000 -3.10 -4.100000
25%    0.720000 -0.95 -2.025000
50%    1.000000  1.20  0.050000
75%    1.700000  3.35  2.125000
max    2.400000  5.50  4.200000

In [13]:
print(df)
print(np.argmin(df),np.argmax(df))

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
2 2
2

In [12]:
print(df)
#최소와 최대의 인덱스 값
print(df.idxmin())
print(df.idxmax())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    4
B    4
C    4
dtype: int64
A    2
B    2
C    2
dtype: int64

In [14]:
print(df)
print(df.std())
print(df.var())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.009554
B    4.300000
C    5.868986
dtype: float64
A     1.0192
B    18.4900
C    34.4450
dtype: float64

In [15]:
print(df)
print(df.skew())
print(df.kurt())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.15207
B    0.00000
C        NaN
dtype: float64
A   NaN
B   NaN
C   NaN
dtype: float64

In [16]:
print(df)
print(df.sum())
print(df.cumsum()) #누적합

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    3.84
B    3.60
C    0.10
dtype: float64
      A    B    C
1  1.00  1.2  NaN
2  3.40  6.7  4.2
3   NaN  NaN  NaN
4  3.84  3.6  0.1

In [17]:
print(df)
print(df.prod())
print(df.cumprod())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A     1.056
B   -20.460
C   -17.220
dtype: float64
       A      B      C
1  1.000   1.20    NaN
2  2.400   6.60   4.20
3    NaN    NaN    NaN
4  1.056 -20.46 -17.22

In [18]:
df.diff()

     A    B   C
1  NaN  NaN NaN
2  1.4  4.3 NaN
3  NaN  NaN NaN
4  NaN  NaN NaN

In [19]:
df.quantile()

A    1.00
B    1.20
C    0.05
Name: 0.5, dtype: float64

In [21]:
df.pct_change()

          A         B        C
1       NaN       NaN      NaN
2  1.400000  3.583333      NaN
3  0.000000  0.000000  0.00000
4 -0.816667 -1.563636 -1.97619

In [22]:
df.corr()

          A         B    C
A  1.000000  0.970725  1.0
B  0.970725  1.000000  1.0
C  1.000000  1.000000  1.0

In [23]:
#어떤 기준으로 상관계수를 구할 지 정할 수 있다
df.corrwith(df.B)

A    0.970725
B    1.000000
C    1.000000
dtype: float64

In [24]:
df.cov()

        A       B       C
A  1.0192   4.214   8.134
B  4.2140  18.490  35.690
C  8.1340  35.690  34.445

In [25]:
df['B'].unique()

array([ 1.2,  5.5,  nan, -3.1])

In [26]:
df['A'].value_counts()

1.00    1
2.40    1
0.44    1
Name: A, dtype: int64

In [27]:
###GroupBy 연산

In [111]:
df = pd.DataFrame({'c1':['a','a','b','b','c','d','b'],
                  'c2':['A','B','B','A','D','C','C'],
                  'c3':np.random.randint(7),
                  'c4':np.random.random(7)})
df

  c1 c2  c3        c4
0  a  A   3  0.049993
1  a  B   3  0.848431
2  b  B   3  0.364939
3  b  A   3  0.434300
4  c  D   3  0.671692
5  d  C   3  0.636729
6  b  C   3  0.967673

In [112]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [113]:
df['c3'].groupby(df['c1']) #그룹바이 객체이다

In [114]:
#c3의 평균을 c1을 기준으로한 그룹에 의해 구했다
df['c3'].groupby(df['c1']).mean()

c1
a    3.0
b    3.0
c    3.0
d    3.0
Name: c3, dtype: float64

In [117]:
df['c4'].groupby(df['c2']).std()

c2
A    0.271746
B    0.341881
C    0.234013
D         NaN
Name: c4, dtype: float64

In [118]:
df['c4'].groupby([df['c1'],df['c2']]).mean()

c1  c2
a   A     0.049993
    B     0.848431
b   A     0.434300
    B     0.364939
    C     0.967673
c   D     0.671692
d   C     0.636729
Name: c4, dtype: float64

In [120]:
#데이터 프레임 형식으로 만들어준다
df['c4'].groupby([df['c1'],df['c2']]).mean().unstack()

c2         A         B         C         D
c1
a   0.049993  0.848431       NaN       NaN
b   0.434300  0.364939  0.967673       NaN
c        NaN       NaN       NaN  0.671692
d        NaN       NaN  0.636729       NaN

In [38]:
df.groupby('c1').mean() #계산이 가능한 type를 가진 애들의 결과 값을 보여준다

     c3        c4
c1
a   5.0  0.447377
b   5.0  0.382999
c   5.0  0.221668
d   5.0  0.074312

In [40]:
df.groupby(['c1','c2']).mean()

        c3        c4
c1 c2
a  A   5.0  0.859743
   B   5.0  0.035012
b  A   5.0  0.827658
   B   5.0  0.271014
   C   5.0  0.050325
c  D   5.0  0.221668
d  C   5.0  0.074312

In [41]:
df.groupby(['c1','c2']).size()

c1  c2
a   A     1
    B     1
b   A     1
    B     1
    C     1
c   D     1
d   C     1
dtype: int64

In [42]:
for c1, group in df.groupby('c1'):
    print(c1)
    print(group)

a
  c1 c2  c3        c4
0  a  A   5  0.859743
1  a  B   5  0.035012
b
  c1 c2  c3        c4
2  b  B   5  0.271014
3  b  A   5  0.827658
6  b  C   5  0.050325
c
  c1 c2  c3        c4
4  c  D   5  0.221668
d
  c1 c2  c3        c4
5  d  C   5  0.074312

In [43]:
for (c1,c2), group in df.groupby(['c1','c2']):
    print((c1,c2))
    print(group)

('a', 'A')
  c1 c2  c3        c4
0  a  A   5  0.859743
('a', 'B')
  c1 c2  c3        c4
1  a  B   5  0.035012
('b', 'A')
  c1 c2  c3        c4
3  b  A   5  0.827658
('b', 'B')
  c1 c2  c3        c4
2  b  B   5  0.271014
('b', 'C')
  c1 c2  c3        c4
6  b  C   5  0.050325
('c', 'D')
  c1 c2  c3        c4
4  c  D   5  0.221668
('d', 'C')
  c1 c2  c3        c4
5  d  C   5  0.074312

In [44]:
df.groupby(['c1','c2'])[['c4']].mean()

             c4
c1 c2
a  A   0.859743
   B   0.035012
b  A   0.827658
   B   0.271014
   C   0.050325
c  D   0.221668
d  C   0.074312

In [45]:
df.groupby('c1')['c3'].quantile()

c1
a    5.0
b    5.0
c    5.0
d    5.0
Name: c3, dtype: float64

In [46]:
df.groupby('c1')['c3'].count()

c1
a    2
b    3
c    1
d    1
Name: c3, dtype: int64

In [47]:
df.groupby('c1')['c4'].median()

c1
a    0.447377
b    0.271014
c    0.221668
d    0.074312
Name: c4, dtype: float64

In [48]:
df.groupby('c1')['c4'].std()

c1
a    0.583173
b    0.400584
c         NaN
d         NaN
Name: c4, dtype: float64

In [49]:
df.groupby(['c1','c2'])['c4'].agg(['mean','min','max'])

           mean       min       max
c1 c2
a  A   0.859743  0.859743  0.859743
   B   0.035012  0.035012  0.035012
b  A   0.827658  0.827658  0.827658
   B   0.271014  0.271014  0.271014
   C   0.050325  0.050325  0.050325
c  D   0.221668  0.221668  0.221668
d  C   0.074312  0.074312  0.074312

In [51]:
df.groupby(['c1','c2'],as_index=False)['c4'].mean()

  c1 c2        c4
0  a  A  0.859743
1  a  B  0.035012
2  b  A  0.827658
3  b  B  0.271014
4  b  C  0.050325
5  c  D  0.221668
6  d  C  0.074312

In [52]:
df.groupby(['c1','c2'],group_keys=False)['c4'].mean()

c1  c2
a   A     0.859743
    B     0.035012
b   A     0.827658
    B     0.271014
    C     0.050325
c   D     0.221668
d   C     0.074312
Name: c4, dtype: float64

In [54]:
def top(df, n=3,column='c1'):
    return df.sort_values(by=column)[-n:]

top(df,n=5)

  c1 c2  c3        c4
2  b  B   5  0.271014
3  b  A   5  0.827658
6  b  C   5  0.050325
4  c  D   5  0.221668
5  d  C   5  0.074312

In [55]:
#group()를 지정할때 top함수를 지정할 수 있다
df.groupby('c1').apply(top)

     c1 c2  c3        c4
c1
a  0  a  A   5  0.859743
   1  a  B   5  0.035012
b  2  b  B   5  0.271014
   3  b  A   5  0.827658
   6  b  C   5  0.050325
c  4  c  D   5  0.221668
d  5  d  C   5  0.074312

In [56]:
###피벗 테이블

In [57]:
df.pivot_table(['c3','c4'],
              index=['c1'],
              columns=['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   5.0  5.0  NaN  NaN  0.859743  0.035012       NaN       NaN
b   5.0  5.0  5.0  NaN  0.827658  0.271014  0.050325       NaN
c   NaN  NaN  NaN  5.0       NaN       NaN       NaN  0.221668
d   NaN  NaN  5.0  NaN       NaN       NaN  0.074312       NaN

In [58]:
df.pivot_table(['c3','c4'],
              index=['c1'],
              columns=['c2'],
              margins=True) #margin은 부분합 총계

      c3                            c4
c2     A    B    C    D  All         A         B         C         D       All
c1
a    5.0  5.0  NaN  NaN  5.0  0.859743  0.035012       NaN       NaN  0.447377
b    5.0  5.0  5.0  NaN  5.0  0.827658  0.271014  0.050325       NaN  0.382999
c    NaN  NaN  NaN  5.0  5.0       NaN       NaN       NaN  0.221668  0.221668
d    NaN  NaN  5.0  NaN  5.0       NaN       NaN  0.074312       NaN  0.074312
All  5.0  5.0  5.0  5.0  5.0  0.843700  0.153013  0.062318  0.221668  0.334247

In [59]:
df.pivot_table(['c3','c4'],
              index=['c1'],
              columns=['c2'],
              margins=True,
              aggfunc=sum)

       c3                             c4                                \
c2      A     B     C    D All         A         B         C         D
c1
a     5.0   5.0   NaN  NaN  10  0.859743  0.035012       NaN       NaN
b     5.0   5.0   5.0  NaN  15  0.827658  0.271014  0.050325       NaN
c     NaN   NaN   NaN  5.0   5       NaN       NaN       NaN  0.221668
d     NaN   NaN   5.0  NaN   5       NaN       NaN  0.074312       NaN
All  10.0  10.0  10.0  5.0  35  1.687401  0.306026  0.124636  0.221668


c2        All
c1
a    0.894754
b    1.148997
c    0.221668
d    0.074312
All  2.339732

In [60]:
df.pivot_table(['c3','c4'],
              index=['c1'],
              columns=['c2'],
              margins=True,
              aggfunc=sum,
              fill_value=0)

     c3                       c4
c2    A   B   C  D All         A         B         C         D       All
c1
a     5   5   0  0  10  0.859743  0.035012  0.000000  0.000000  0.894754
b     5   5   5  0  15  0.827658  0.271014  0.050325  0.000000  1.148997
c     0   0   0  5   5  0.000000  0.000000  0.000000  0.221668  0.221668
d     0   0   5  0   5  0.000000  0.000000  0.074312  0.000000  0.074312
All  10  10  10  5  35  1.687401  0.306026  0.124636  0.221668  2.339732

In [61]:
pd.crosstab(df.c1,df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   1  1  1  0
c   0  0  0  1
d   0  0  1  0

In [63]:
pd.crosstab(df.c1,df.c2,values=df.c3,aggfunc=sum,margins=True)

c2      A     B     C    D  All
c1
a     5.0   5.0   NaN  NaN   10
b     5.0   5.0   5.0  NaN   15
c     NaN   NaN   NaN  5.0    5
d     NaN   NaN   5.0  NaN    5
All  10.0  10.0  10.0  5.0   35

In [64]:
####범주형 데이터

In [65]:
s = pd.Series(['c1','c2','c1','c2','c1']*2)
s

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
dtype: object

In [66]:
pd.unique(s)

array(['c1', 'c2'], dtype=object)

In [67]:
pd.value_counts(s)

c1    6
c2    4
dtype: int64

In [69]:
code = pd.Series([0,1,0,1,0]*2)
code

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    1
9    0
dtype: int64

In [70]:
d = pd.Series(['c1','c2'])
d

0    c1
1    c2
dtype: object

In [72]:
d.take(code) #범주형자료에 코드를 붙일 수 있다.

0    c1
1    c2
0    c1
1    c2
0    c1
0    c1
1    c2
0    c1
1    c2
0    c1
dtype: object

In [74]:
df = pd.DataFrame({'id':np.arange(len(s)),
                  'c':s,
                  'v':np.random.randint(1000,5000,size=len(s))})
df

   id   c     v
0   0  c1  3109
1   1  c2  4433
2   2  c1  1844
3   3  c2  4141
4   4  c1  3520
5   5  c1  2774
6   6  c2  3869
7   7  c1  2852
8   8  c2  3254
9   9  c1  4065

In [75]:
c= df['c'].astype('category')
c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [76]:
c.values

['c1', 'c2', 'c1', 'c2', 'c1', 'c1', 'c2', 'c1', 'c2', 'c1']
Categories (2, object): ['c1', 'c2']

In [77]:
c.values.categories

Index(['c1', 'c2'], dtype='object')

In [78]:
c.values.codes

array([0, 1, 0, 1, 0, 0, 1, 0, 1, 0], dtype=int8)

In [79]:
#카테고리 타입을 바꾼 것을 데이터 프레임에 업데이트
df['c']= c 
df.c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [80]:
c=pd.Categorical(['c1','c2','c3','c1','c2'])
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [81]:
categories = ['c1','c2','c3']
codes=[0,1,2,0,1]
c = pd.Categorical.from_codes(codes,categories)
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [83]:
pd.Categorical.from_codes(codes,categories,ordered=True)

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [84]:
c.as_ordered()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [85]:
c.codes

array([0, 1, 2, 0, 1], dtype=int8)

In [86]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [87]:
#카테고리 추가
c= c.set_categories(['c1','c2','c3','c4','c5'])
c.categories

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [88]:
c.value_counts()

c1    2
c2    2
c3    1
c4    0
c5    0
dtype: int64

In [90]:
c[c.isin(['c1','c3'])]

['c1', 'c3', 'c1']
Categories (5, object): ['c1', 'c2', 'c3', 'c4', 'c5']

In [93]:
#값이 없는 카테고리 삭제
c = c.remove_unused_categories()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [94]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [95]:
###문자열 연산

In [99]:
name_tuple = ['Suan Lee','Steven Jobs','Larry Page','Elon Musjk',None,'Bill Gates','Mark Zuckerberg','Jeff Bezos']
names = pd.Series(name_tuple)
names

0           Suan Lee
1        Steven Jobs
2         Larry Page
3         Elon Musjk
4               None
5         Bill Gates
6    Mark Zuckerberg
7         Jeff Bezos
dtype: object

In [100]:
names.str.lower()

0           suan lee
1        steven jobs
2         larry page
3         elon musjk
4               None
5         bill gates
6    mark zuckerberg
7         jeff bezos
dtype: object

In [101]:
names.str.len()

0     8.0
1    11.0
2    10.0
3    10.0
4     NaN
5    10.0
6    15.0
7    10.0
dtype: float64

In [102]:
names.str.split()

0           [Suan, Lee]
1        [Steven, Jobs]
2         [Larry, Page]
3         [Elon, Musjk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezos]
dtype: object

In [103]:
names.str[0:4]

0    Suan
1    Stev
2    Larr
3    Elon
4    None
5    Bill
6    Mark
7    Jeff
dtype: object

In [104]:
names.str.split().str.get(-1)

0           Lee
1          Jobs
2          Page
3         Musjk
4          None
5         Gates
6    Zuckerberg
7         Bezos
dtype: object

In [105]:
names.str.repeat(2)

0                  Suan LeeSuan Lee
1            Steven JobsSteven Jobs
2              Larry PageLarry Page
3              Elon MusjkElon Musjk
4                              None
5              Bill GatesBill Gates
6    Mark ZuckerbergMark Zuckerberg
7              Jeff BezosJeff Bezos
dtype: object

In [106]:
names.str.join("*")

0                  S*u*a*n* *L*e*e
1            S*t*e*v*e*n* *J*o*b*s
2              L*a*r*r*y* *P*a*g*e
3              E*l*o*n* *M*u*s*j*k
4                             None
5              B*i*l*l* *G*a*t*e*s
6    M*a*r*k* *Z*u*c*k*e*r*b*e*r*g
7              J*e*f*f* *B*e*z*o*s
dtype: object

In [107]:
names.str.match('([A-Za-z]+)')

0    True
1    True
2    True
3    True
4    None
5    True
6    True
7    True
dtype: object

In [109]:
names.str.findall('([A-Za-z]+)')

0           [Suan, Lee]
1        [Steven, Jobs]
2         [Larry, Page]
3         [Elon, Musjk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezos]
dtype: object

In [ ]:
###시계열 처리